mesh_study/case_20000L/case_20000L_mesh2/0.org/U.air.template
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U.air;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    outlet
    {
        type            pressureInletOutletVelocity;
	phi             phi.air;
        value           uniform (0 0 0);
    }
    sparger_upper
    {
        type            fixedValue;
        value           uniform (0 |-U_in-| 0);
    }
    wall
    {
        type            slip;
    }
}


// ************************************************************************* //
