mesh_study/case_20000L/case_20000L_mesh2/0.org/epsilonm
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      epsilonm;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.00011512832386681257;

boundaryField
{
    outlet
    {
        type            inletOutlet;
        phi             phim;
        inletValue      uniform 5.788625412117857e-16;
        value           uniform 5.788625412117857e-16;
    }

    sparger_upper
    {
        type            fixedValue;
        value           $internalField;
    }

    wall
    {
        type            epsilonmWallFunction;
        value           $internalField;
    }
}

// ************************************************************************* //
