mesh_study/case_20000L/case_20000L_mesh2/0.org/km.template
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      km;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform |-k_in-|;

boundaryField
{
    outlet
    {
        type            inletOutlet;
        phi             phim;
        inletValue      uniform |-k_out-|;
        value           uniform |-k_out-|;
    }
    wall
    {
        type            zeroGradient;
        value           $internalField;
    }
    sparger_upper
    {
        type            fixedValue;
        value           $internalField;
    }
}

// ************************************************************************* //
