mesh_study/case_20000L/case_20000L_mesh2/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "/data/openfoam-10/run/of-bioreactors/configs/solvers.default"

PIMPLE
{
    nOuterCorrectors 1;
    nCorrectors      4;
    nNonOrthogonalCorrectors 3;
}

// ************************************************************************* //
