mesh_study/case_20000L/case_20000L_mesh2/system/include/probe_locations
// x y z //
( 0.6227722069127497 0.5374987077556664 0.6227722069127496 )
( 0.6227722069127497 1.006551887182896 0.6227722069127496 )
( 0.6227722069127497 2.768017689752964 0.6227722069127496 )
( 0.6227722069127497 4.529483492323032 0.6227722069127496 )
