mesh_study/case_20000L/case_20000L_mesh2/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.air 1e-3
    volScalarFieldValue alpha.water 0.999
);

regions
(
    boxToCell
    {
        box (-1.25818985897862 4.026207548731584 -1.25818985897862) (1.25818985897862 5.03275943591448 1.25818985897862);
        fieldValues
        (
            volScalarFieldValue alpha.air 0.999999
            volScalarFieldValue alpha.water 1e-6
        );
    }
);


// ************************************************************************* //
